<?php
// Heading
$_['heading_title']             = 'Массовое копирование товаров по атрибутам';

// Text
$_['text_loading']              = 'Загрузка... Пожалуйста, подождите.';
$_['text_no_products']          = 'Не выбрано ни одного товара для копирования!';
$_['text_two_products']         = 'Выбрано более одного товара. Для массового копирования по атрибутам, пожалуйста, выберите только один товар.';
$_['text_max_10_products']      = 'Вы выбрали более 10 товаров. Для лучшей производительности, пожалуйста, выберите не более 10 товаров для массового копирования по атрибутам.';
$_['text_selected_product']     = 'Выбранный товар:';
$_['text_choose_attributes']    = 'Пожалуйста, выберите атрибуты для копирования:';
$_['text_new_products']         = 'Будут созданы новые товары с выбранными значениями атрибута:';
$_['text_select_all_values']    = 'Выбрать все значения атрибута';
$_['text_no_attributes']        = 'Не найдены атрибуты с типом "select". Пожалуйста, сначала добавьте атрибуты.';
$_['text_no_values']            = 'Не найдены значения для этого атрибута. Пожалуйста, сначала добавьте значения.';
$_['text_products_status']      = 'Все новые товары будут иметь статус "Включено" по умолчанию.';
$_['text_products_title']       = 'Все новые товары будут иметь название & meta title со значением атрибута.';
$_['text_add_type']             = 'Тип добавления:';
$_['text_remove_and_add']       = 'Удалить выбранный товар и добавить новые с выбранными атрибутами';
$_['text_add_only']             = 'Только добавить новые товары с выбранными атрибутами';
$_['text_success']              = 'Успешно создано %s новых товаров выбранными значениями атрибута.';

// Buttons
$_['text_cancel']               = 'Отмена';
$_['text_copy']                 = 'Копировать';

// Error
$_['error_permission']              = 'У вас нет прав для доступа к этой функции!';
$_['error_missing_product_id']      = 'Отсутствует ID товара для массового копирования!';
$_['error_missing_attribute_id']    = 'Отсутствует ID атрибута для получения значений!';
$_['error_no_attribute_values']     = 'Выберите значения для атрибута!';
$_['error_fetching_data']           = 'Ошибка при получении данных. Пожалуйста, попробуйте позже.';
